from pyPdf import FPDF
def result_to_pdf(index, setup, result, file_name):
    pdf = FPDF()
    pdf.add_page()
    pdf.set_font('Courier', 'B', 16)
    pdf.cell(40, 10, 'Hello World!')
    pdf.output(file_name, 'F')
u = []
a = ['Велосипед', 'Самокат', 'Роликовые коньки', 'Уницикл', 'Скейтборд', 'Галера', 'Каяка', 'Катамаран']
b = ['Трамвай', 'Троллейбус', 'Поезд', 'Электричка', 'Самолёт', 'Баржа', 'Маршутное такси', 'Автобус']
c = ['Галера', 'Каяка', 'Катамаран', 'Баржа', 'Яхта', 'Гидроцикл', 'Каравелла', 'Подводная лодка', ]
d = []
a_property = 'Транспорт, приводимый в движение человеческой силой'
b_property = 'Общественный транспорт'
c_property = 'Морской транспорт'
d_property = ''